Revit 2026 API

# ExportPDFSettingsGetActivePredefinedSettings Method

---

Gets the active settings element in the document.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static ExportPDFSettings GetActivePredefinedSettings(
	Document document
)
```
```vb
Public Shared Function GetActivePredefinedSettings (
	document As Document
) As ExportPDFSettings
```
```cpp
public:
static ExportPDFSettings^ GetActivePredefinedSettings(
	Document^ document
)
```
```fsharp
static member GetActivePredefinedSettings :
        document : Document -> ExportPDFSettings
```

#### Parameters

document Document
     The document to find the active settings.

#### Return Value

ExportPDFSettings The active settings, or  if none.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

ExportPDFSettings Class

Autodesk.Revit.DB Namespace